### Terraform plan (dev) — completed

<details><summary>Show plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.codebase will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "codebase" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../../dist"
      + type                = "zip"
    }

  # aws_api_gateway_deployment.this must be replaced
+/- resource "aws_api_gateway_deployment" "this" {
      ~ created_date = "2025-09-02T10:39:07Z" -> (known after apply)
      ~ id           = "psjc8o" -> (known after apply)
      ~ triggers     = {
          - "redeployment" = "0584ca2cf14e0909ef88ae62f47b15d206d8e76d"
        } -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.third_party_resource_by_id will be created
  + resource "aws_api_gateway_integration" "third_party_resource_by_id" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "sa-east-1"
      + request_parameters      = {
          + "integration.request.path.resourceId" = "method.request.path.resourceId"
          + "integration.request.path.userId"     = "method.request.path.userId"
        }
      + resource_id             = (known after apply)
      + rest_api_id             = "gqkpp4nrmg"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration.third_party_resources will be created
  + resource "aws_api_gateway_integration" "third_party_resources" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "sa-east-1"
      + request_parameters      = {
          + "integration.request.path.userId" = "method.request.path.userId"
        }
      + resource_id             = (known after apply)
      + rest_api_id             = "gqkpp4nrmg"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration.user will be created
  + resource "aws_api_gateway_integration" "user" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "sa-east-1"
      + request_parameters      = {
          + "integration.request.path.userId" = "method.request.path.userId"
        }
      + resource_id             = (known after apply)
      + rest_api_id             = "gqkpp4nrmg"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration.users will be created
  + resource "aws_api_gateway_integration" "users" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "sa-east-1"
      + resource_id             = (known after apply)
      + rest_api_id             = "gqkpp4nrmg"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.third_party_resource_by_id will be created
  + resource "aws_api_gateway_method" "third_party_resource_by_id" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = "r72709"
      + http_method        = "ANY"
      + id                 = (known after apply)
      + region             = "sa-east-1"
      + request_parameters = {
          + "method.request.path.resourceId" = true
          + "method.request.path.userId"     = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "gqkpp4nrmg"
    }

  # aws_api_gateway_method.third_party_resources will be created
  + resource "aws_api_gateway_method" "third_party_resources" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = "r72709"
      + http_method        = "ANY"
      + id                 = (known after apply)
      + region             = "sa-east-1"
      + request_parameters = {
          + "method.request.path.userId" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "gqkpp4nrmg"
    }

  # aws_api_gateway_method.user will be created
  + resource "aws_api_gateway_method" "user" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = "r72709"
      + http_method        = "ANY"
      + id                 = (known after apply)
      + region             = "sa-east-1"
      + request_parameters = {
          + "method.request.path.userId" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "gqkpp4nrmg"
    }

  # aws_api_gateway_method.users will be created
  + resource "aws_api_gateway_method" "users" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = "r72709"
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "sa-east-1"
      + resource_id      = (known after apply)
      + rest_api_id      = "gqkpp4nrmg"
    }

  # aws_api_gateway_resource.third_party will be created
  + resource "aws_api_gateway_resource" "third_party" {
      + id          = (known after apply)
      + parent_id   = "fmxjzd"
      + path        = (known after apply)
      + path_part   = "third-party"
      + region      = "sa-east-1"
      + rest_api_id = "gqkpp4nrmg"
    }

  # aws_api_gateway_resource.third_party_resource will be created
  + resource "aws_api_gateway_resource" "third_party_resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "resource"
      + region      = "sa-east-1"
      + rest_api_id = "gqkpp4nrmg"
    }

  # aws_api_gateway_resource.third_party_resource_id will be created
  + resource "aws_api_gateway_resource" "third_party_resource_id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{resourceId}"
      + region      = "sa-east-1"
      + rest_api_id = "gqkpp4nrmg"
    }

  # aws_api_gateway_resource.third_party_user will be created
  + resource "aws_api_gateway_resource" "third_party_user" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "users"
      + region      = "sa-east-1"
      + rest_api_id = "gqkpp4nrmg"
    }

  # aws_api_gateway_resource.third_party_user_resource will be created
  + resource "aws_api_gateway_resource" "third_party_user_resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{userId}"
      + region      = "sa-east-1"
      + rest_api_id = "gqkpp4nrmg"
    }

  # aws_api_gateway_resource.user will be created
  + resource "aws_api_gateway_resource" "user" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{userId}"
      + region      = "sa-east-1"
      + rest_api_id = "gqkpp4nrmg"
    }

  # aws_api_gateway_resource.users will be created
  + resource "aws_api_gateway_resource" "users" {
      + id          = (known after apply)
      + parent_id   = "fmxjzd"
      + path        = (known after apply)
      + path_part   = "users"
      + region      = "sa-east-1"
      + rest_api_id = "gqkpp4nrmg"
    }

  # aws_api_gateway_stage.this will be updated in-place
  ~ resource "aws_api_gateway_stage" "this" {
      ~ deployment_id         = "psjc8o" -> (known after apply)
        id                    = "ags-gqkpp4nrmg-dev"
        tags                  = {}
        # (15 unchanged attributes hidden)
    }

  # aws_dynamodb_table.users will be created
  + resource "aws_dynamodb_table" "users" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "PK"
      + id               = (known after apply)
      + name             = "tf-serverless-dev-users"
      + range_key        = "SK"
      + read_capacity    = (known after apply)
      + region           = "sa-east-1"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Service"     = "tf-serverless"
        }
      + tags_all         = {
          + "CreateAt"    = "2025-09-01"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "Cleber Gasparoto"
          + "Project"     = "TF AWS Serverless"
          + "Service"     = "tf-serverless"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Email"
          + type = "S"
        }
      + attribute {
          + name = "PK"
          + type = "S"
        }
      + attribute {
          + name = "SK"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "Email"
          + name               = "EmailIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_lambda_permission.apigw will be destroyed
  # (because aws_lambda_permission.apigw is not in configuration)
  - resource "aws_lambda_permission" "apigw" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "tf-serverless-dev-dynamodb" -> null
      - id                  = "AllowExecutionFromAPIGateway" -> null
      - principal           = "apigateway.amazonaws.com" -> null
      - region              = "sa-east-1" -> null
      - source_arn          = "arn:aws:execute-api:sa-east-1:968339500772:gqkpp4nrmg/*" -> null
      - statement_id        = "AllowExecutionFromAPIGateway" -> null
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_permission.apigw_dynamodb will be created
  + resource "aws_lambda_permission" "apigw_dynamodb" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "tf-serverless-dev-dynamodb"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "sa-east-1"
      + source_arn          = "arn:aws:execute-api:sa-east-1:968339500772:gqkpp4nrmg/*"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.apigw_third_party will be created
  + resource "aws_lambda_permission" "apigw_third_party" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "tf-serverless-dev-third-party"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "sa-east-1"
      + source_arn          = "arn:aws:execute-api:sa-east-1:968339500772:gqkpp4nrmg/*"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # aws_lambda_permission.apigw_user_management will be created
  + resource "aws_lambda_permission" "apigw_user_management" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "tf-serverless-dev-user-management"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "sa-east-1"
      + source_arn          = "arn:aws:execute-api:sa-east-1:968339500772:gqkpp4nrmg/*"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_object.lambda_artefact must be replaced
+/- resource "aws_s3_object" "lambda_artefact" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::968339500772-tf-serverless-lambda-artefacts/builds/417ad343-9290-fc40-4fdf-6944796d7bb0.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ etag                          = "ae11ca1dfd13ee12431405f7275e030d-3" -> (known after apply)
      ~ id                            = "968339500772-tf-serverless-lambda-artefacts/builds/417ad343-9290-fc40-4fdf-6944796d7bb0.zip" -> (known after apply)
      ~ key                           = "builds/417ad343-9290-fc40-4fdf-6944796d7bb0.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "files/417ad343-9290-fc40-4fdf-6944796d7bb0.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # random_uuid.build_id must be replaced
+/- resource "random_uuid" "build_id" {
      ~ id      = "417ad343-9290-fc40-4fdf-6944796d7bb0" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "code_hash" = "70c21b8484dab0bd8ae02568718bedecb1de5628" -> "7d61a813b859f905253fe3ae9049386ccaec39dc"
        }
      ~ result  = "417ad343-9290-fc40-4fdf-6944796d7bb0" -> (known after apply)
    }

  # terraform_data.build must be replaced
+/- resource "terraform_data" "build" {
      ~ id               = "0503808d-b009-a358-0459-9c1c9793d70f" -> (known after apply)
      ~ triggers_replace = {
          ~ code_hash = "70c21b8484dab0bd8ae02568718bedecb1de5628" -> "7d61a813b859f905253fe3ae9049386ccaec39dc"
        }
    }

  # module.iam_role_third_party_lambda.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "tf-serverless-dev-third-party-lambda-execute-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:Query",
                          + "dynamodb:GetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:sa-east-1:968339500772:table/tf-serverless-dev-users/index/*",
                          + "arn:aws:dynamodb:sa-east-1:968339500772:table/tf-serverless-dev-users",
                        ]
                      + Sid      = "AllowDynamoDBUserTableActions"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:sa-east-1:968339500772:secret:*"
                      + Sid      = "AllowSecretsManagerAccess"
                    },
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = "AllowCreatingLogGroups"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:log-group:/aws/lambda/*:*"
                      + Sid      = "AllowWritingLogs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
    }

  # module.iam_role_third_party_lambda.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tf-serverless-dev-third-party-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam_role_third_party_lambda.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "tf-serverless-dev-third-party-lambda-role"
    }

  # module.iam_role_user_management_lambda.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "tf-serverless-dev-user-management-lambda-execute-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:sa-east-1:968339500772:table/tf-serverless-dev-users/index/*",
                          + "arn:aws:dynamodb:sa-east-1:968339500772:table/tf-serverless-dev-users",
                        ]
                      + Sid      = "AllowDynamoDBUserTableActions"
                    },
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = "AllowCreatingLogGroups"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:log-group:/aws/lambda/*:*"
                      + Sid      = "AllowWritingLogs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
    }

  # module.iam_role_user_management_lambda.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tf-serverless-dev-user-management-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam_role_user_management_lambda.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "tf-serverless-dev-user-management-lambda-role"
    }

  # module.lambda_dynamodb.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "tf-serverless-dev-dynamodb"
      ~ last_modified                  = "2025-09-02T10:38:15.166+0000" -> (known after apply)
      ~ s3_key                         = "builds/417ad343-9290-fc40-4fdf-6944796d7bb0.zip" -> (known after apply)
      ~ source_code_hash               = "ntG1X0Vqc7SUnZzxyI3dd+udCrlB9PF4A2ksdvlW2Q4=" -> (known after apply)
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda_third_party.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/tf-serverless-dev-third-party"
      + name_prefix       = (known after apply)
      + region            = "sa-east-1"
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
    }

  # module.lambda_third_party.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Handles third-party service integration with Cognito authentication"
      + function_name                  = "tf-serverless-dev-third-party"
      + handler                        = "lambdas/third-party.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "sa-east-1"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs22.x"
      + s3_bucket                      = "968339500772-tf-serverless-lambda-artefacts"
      + s3_key                         = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AWS_NODEJS_CONNECTION_REUSE_ENABLED" = "1"
              + "AWS_REGION"                          = "sa-east-1"
              + "COGNITO_USER_POOL_ID"                = "sa-east-1_im6abs9EO"
              + "CORS_CREDS"                          = "'false'"
              + "CORS_HEADERS"                        = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
              + "CORS_METHODS"                        = "'DELETE,GET,HEAD,OPTIONS,PATCH,POST,PUT'"
              + "CORS_ORIGINS"                        = "'*'"
              + "DEBUG"                               = "true"
              + "USERS_TABLE_NAME"                    = "tf-serverless-dev-users"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.lambda_user_management.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/tf-serverless-dev-user-management"
      + name_prefix       = (known after apply)
      + region            = "sa-east-1"
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
    }

  # module.lambda_user_management.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Handles user management operations with Cognito authentication"
      + function_name                  = "tf-serverless-dev-user-management"
      + handler                        = "lambdas/user-management.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "sa-east-1"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs22.x"
      + s3_bucket                      = "968339500772-tf-serverless-lambda-artefacts"
      + s3_key                         = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AWS_NODEJS_CONNECTION_REUSE_ENABLED" = "1"
              + "AWS_REGION"                          = "sa-east-1"
              + "COGNITO_USER_POOL_ID"                = "sa-east-1_im6abs9EO"
              + "CORS_CREDS"                          = "'false'"
              + "CORS_HEADERS"                        = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
              + "CORS_METHODS"                        = "'DELETE,GET,HEAD,OPTIONS,PATCH,POST,PUT'"
              + "CORS_ORIGINS"                        = "'*'"
              + "DEBUG"                               = "true"
              + "USERS_TABLE_NAME"                    = "tf-serverless-dev-users"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

Plan: 33 to add, 2 to change, 5 to destroy.

```
</details>